trunk/eid-pki-ra-client-xkms/src/test/resources/exampleSigningRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><BulkRegister xmlns="http://www.w3.org/2002/03/xkms-xbulk" xmlns:ns2="http://xkms.ubizen.com/kitoshi" xmlns:ns3="http://www.xkms.org/schema/xkms-2001-01-20" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#"><SignedPart Id="signed-part"><BatchHeader><BatchID>batch-id-d05e3182-1a9e-402f-9ed3-4f26dc39dd35</BatchID><BatchTime>2010-12-01T07:48:31.510Z</BatchTime><NumberOfRequests>1</NumberOfRequests></BatchHeader><ns3:Respond><ns3:string>RetrievalMethod</ns3:string><ns3:string>X509Cert</ns3:string></ns3:Respond><Requests number="1"><Request><ns3:Status>Indeterminate</ns3:Status><ns3:KeyID>key-id-7beed0d6-4bad-4336-9eb5-4c0f534c71c8</ns3:KeyID><ns4:KeyInfo><ns4:KeyName>http://xkms.og.ubizen.com/keyname?buc_id=8047651269</ns4:KeyName><PKCS10>MIIBqDCCARECAQAwaDELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB0xpbWJ1cmcxEDAOBgNVBAcTB0hhc3NlbHQxGTAXBgNVBAoTEEFDQSBJVC1Tb2x1dGlvbnMxGjAYBgNVBAMTEUphbiBWYW4gZGVuIEJlcmdoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCl9kIB3oD4AO4RBICIW8jkXXc/alX0cRHb+BrorI8g95eaN15VV4WTXsaw+Kx67xn8QkjgrI76z2dTaBhgaTFdzxYNO4Pqt+ajKGV4BP0Lquh7qyO1k/IT/KyyAdlHbJq8VD+Od/AnknnQminCw1TEPZfFck+HGGCvRrSeflRaXwIDAQABoAAwDQYJKoZIhvcNAQEFBQADgYEAJTlkGaB4CQIiZ+RP6NFYqe23ZpkU2GpSbUNJRGd7+a7RHQxodGQjZWpctP14R3C0iBHi6G8C7E5zhHWRyFtzxT3MVBFH33kuHxcRkAlDKZNAWyu8/pH4Z3DIUVriyhH2pUweqSXaaAaqmgocOH7vJzXLQ3WpNR1UsC/69kNpmpE=</PKCS10></ns4:KeyInfo><ProcessInfo><ns2:Publish>true</ns2:Publish><ns2:AttributeCertificate><ns2:ValidityInterval><ns2:NotBefore>2010-12-01T07:53:31.507Z</ns2:NotBefore><ns2:NotAfter>2012-03-01T07:53:31.507Z</ns2:NotAfter></ns2:ValidityInterval></ns2:AttributeCertificate></ProcessInfo></Request></Requests></SignedPart><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#signed-part"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>ZGromFrsS5+pHAsV6vGzZKPit6U=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>WUvmXcUMfMjrl+d2bBFVh4Eug/reeardIDeM88ynT+f44xfZt9U1V9AplhAa1OhgETQmx3VSv7mV
g1XR96RllGsAlE/THCzkY6WowCtDecCX80L3xeonazaz5lQmng9B2MdW4CHCIKG9aMqNavvWkj3k
i3Y98SEAPT0cUOdIeYA=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509SubjectName>CN=Test User, OU=Unknown, O=Test, L=Unknown, ST=Unknown, C=BE</ds:X509SubjectName></ds:X509Data></ds:KeyInfo></ds:Signature></BulkRegister></Body></Envelope>
